---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ImportAdtEntityLength
source: html/6eeeb868-ced5-4650-4bb9-718009f499b5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ImportAdtEntityLength Property

"Length"

## Syntax (C#)
```csharp
public static ForgeTypeId ImportAdtEntityLength { get; }
```